#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/hamacorp/learn-terraform-staging/runs/run-8j77cgehyeMTRvYr

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.nacl.aws_network_acl.network_acl_private_app_subnet_a will be created
  + resource "aws_network_acl" "network_acl_private_app_subnet_a" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateAppSubnetA-NACL"
          + "Tier" = "App"
        }
      + tags_all   = {
          + "Name" = "PrivateAppSubnetA-NACL"
          + "Tier" = "App"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_private_app_subnet_b will be created
  + resource "aws_network_acl" "network_acl_private_app_subnet_b" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateAppSubnetB-NACL"
          + "Tier" = "App"
        }
      + tags_all   = {
          + "Name" = "PrivateAppSubnetB-NACL"
          + "Tier" = "App"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_private_app_subnet_c will be created
  + resource "aws_network_acl" "network_acl_private_app_subnet_c" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateAppSubnetC-NACL"
          + "Tier" = "App"
        }
      + tags_all   = {
          + "Name" = "PrivateAppSubnetC-NACL"
          + "Tier" = "App"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_private_db_subnet_a will be created
  + resource "aws_network_acl" "network_acl_private_db_subnet_a" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateDBSubnetA-NACL"
          + "Tier" = "DB"
        }
      + tags_all   = {
          + "Name" = "PrivateDBSubnetA-NACL"
          + "Tier" = "DB"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_private_db_subnet_b will be created
  + resource "aws_network_acl" "network_acl_private_db_subnet_b" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateDBSubnetB-NACL"
          + "Tier" = "DB"
        }
      + tags_all   = {
          + "Name" = "PrivateDBSubnetB-NACL"
          + "Tier" = "DB"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_private_db_subnet_c will be created
  + resource "aws_network_acl" "network_acl_private_db_subnet_c" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateDBSubnetC-NACL"
          + "Tier" = "DB"
        }
      + tags_all   = {
          + "Name" = "PrivateDBSubnetC-NACL"
          + "Tier" = "DB"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_private_network_subnet_a will be created
  + resource "aws_network_acl" "network_acl_private_network_subnet_a" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateNetworkSubnetA-NACL"
          + "Tier" = "Network"
        }
      + tags_all   = {
          + "Name" = "PrivateNetworkSubnetA-NACL"
          + "Tier" = "Network"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_private_network_subnet_b will be created
  + resource "aws_network_acl" "network_acl_private_network_subnet_b" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateNetworkSubnetB-NACL"
          + "Tier" = "Network"
        }
      + tags_all   = {
          + "Name" = "PrivateNetworkSubnetB-NACL"
          + "Tier" = "Network"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_private_network_subnet_c will be created
  + resource "aws_network_acl" "network_acl_private_network_subnet_c" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateNetworkSubnetC-NACL"
          + "Tier" = "Network"
        }
      + tags_all   = {
          + "Name" = "PrivateNetworkSubnetC-NACL"
          + "Tier" = "Network"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_public_subnet_a will be created
  + resource "aws_network_acl" "network_acl_public_subnet_a" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PublicSubnetA-NACL"
          + "Tier" = "Public"
        }
      + tags_all   = {
          + "Name" = "PublicSubnetA-NACL"
          + "Tier" = "Public"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_public_subnet_b will be created
  + resource "aws_network_acl" "network_acl_public_subnet_b" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PublicSubnetB-NACL"
          + "Tier" = "Public"
        }
      + tags_all   = {
          + "Name" = "PublicSubnetB-NACL"
          + "Tier" = "Public"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_public_subnet_c will be created
  + resource "aws_network_acl" "network_acl_public_subnet_c" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PublicSubnetC-NACL"
          + "Tier" = "Public"
        }
      + tags_all   = {
          + "Name" = "PublicSubnetC-NACL"
          + "Tier" = "Public"
        }
      + vpc_id     = (known after apply)
    }

  # module.nacl.aws_network_acl.network_acl_vpc will be created
  + resource "aws_network_acl" "network_acl_vpc" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags_all   = (known after apply)
      + vpc_id     = (known after apply)
    }

  # module.subnet.aws_subnet.private_app_subnet_a will be created
  + resource "aws_subnet" "private_app_subnet_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.112.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateAppSubnetA"
          + "Tier" = "App"
        }
      + tags_all                                       = {
          + "Name" = "PrivateAppSubnetA"
          + "Tier" = "App"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_app_subnet_b will be created
  + resource "aws_subnet" "private_app_subnet_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.128.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateAppSubnetB"
          + "Tier" = "App"
        }
      + tags_all                                       = {
          + "Name" = "PrivateAppSubnetB"
          + "Tier" = "App"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_app_subnet_c will be created
  + resource "aws_subnet" "private_app_subnet_c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.144.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateAppSubnetC"
          + "Tier" = "App"
        }
      + tags_all                                       = {
          + "Name" = "PrivateAppSubnetC"
          + "Tier" = "App"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_db_subnet_a will be created
  + resource "aws_subnet" "private_db_subnet_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.208.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateDBSubnetA"
          + "Tier" = "DB"
        }
      + tags_all                                       = {
          + "Name" = "PrivateDBSubnetA"
          + "Tier" = "DB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_db_subnet_b will be created
  + resource "aws_subnet" "private_db_subnet_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.224.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateDBSubnetB"
          + "Tier" = "DB"
        }
      + tags_all                                       = {
          + "Name" = "PrivateDBSubnetB"
          + "Tier" = "DB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_db_subnet_c will be created
  + resource "aws_subnet" "private_db_subnet_c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.240.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateDBSubnetC"
          + "Tier" = "DB"
        }
      + tags_all                                       = {
          + "Name" = "PrivateDBSubnetC"
          + "Tier" = "DB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_network_subnet_a will be created
  + resource "aws_subnet" "private_network_subnet_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateNetworkSubnetA"
          + "Tier" = "Network"
        }
      + tags_all                                       = {
          + "Name" = "PrivateNetworkSubnetA"
          + "Tier" = "Network"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_network_subnet_b will be created
  + resource "aws_subnet" "private_network_subnet_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateNetworkSubnetB"
          + "Tier" = "Network"
        }
      + tags_all                                       = {
          + "Name" = "PrivateNetworkSubnetB"
          + "Tier" = "Network"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_network_subnet_c will be created
  + resource "aws_subnet" "private_network_subnet_c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateNetworkSubnetC"
          + "Tier" = "Network"
        }
      + tags_all                                       = {
          + "Name" = "PrivateNetworkSubnetC"
          + "Tier" = "Network"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public_subnet_a will be created
  + resource "aws_subnet" "public_subnet_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PublicSubnetA"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name" = "PublicSubnetA"
          + "Tier" = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public_subnet_b will be created
  + resource "aws_subnet" "public_subnet_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PublicSubnetB"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name" = "PublicSubnetB"
          + "Tier" = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public_subnet_c will be created
  + resource "aws_subnet" "public_subnet_c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PublicSubnetC"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name" = "PublicSubnetC"
          + "Tier" = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.controltower_vpc will be created
  + resource "aws_vpc" "controltower_vpc" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "172.31.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = false
      + enable_classiclink_dns_support       = false
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "aws-controltower-VPC"
        }
      + tags_all                             = {
          + "Name" = "aws-controltower-VPC"
        }
    }

Plan: 26 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @avosalmon, Action: `pull_request`*